In [1]:
import pandas as pd 

data = {"Name":["john","peter","lisa"],
         "Age":[25,28,31],
         "Salary":[30000,45000,25000]}
df = pd.DataFrame(data)
print(df)   # create own data 
print(type(df)) # check the data type

    Name  Age  Salary
0   john   25   30000
1  peter   28   45000
2   lisa   31   25000
<class 'pandas.core.frame.DataFrame'>

In [2]:
import pandas as pd  # import csv files 

data = pd.read_csv("company.csv")
print(data)

   Unnamed: 0      Name gender  salary
0           0    ayushi      F   20000
1           1     rohit      M   25000
2           2  pranjali      F   27000

In [3]:
import pandas as pd  # import excel file 
data1 = pd.read_excel("ESD.xlsx")
print(data1.head(5))
print(data1.tail(5))

     EEID        Full Name                 Job Title Department  \
0  E02387      Emily Davis                Sr. Manger         IT
1  E04105    Theodore Dinh       Technical Architect         IT
2  E02572     Luna Sanders                  Director    Finance
3  E02832  Penelope Jordan  Computer Systems Manager         IT
4  E01639        Austin Vo               Sr. Analyst    Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
       EEID     Full Name       Job Title  Department        Business Unit  \
995  E03094  Wesley Young     Sr. Analyst   Marketing  Speciality Products
996  E01909  Lillian Khan         Analyst     Finance  Speciality Products
997  E04398   Oliver Yang        Director   Marketing  Speciality Products
998  E02521   Lily Nguyen     Sr. Analyst     Finance  Speciality Products
999  E03545   Sofia Cheng  Vice President  Accounting            Corporate

     Gender  Ethnicity  Age  Hire Date  Annual Salary  Bonus %        Country  \
995    Male  Caucasian   33 2016-09-18          98427     0.00  United States
996  Female      Asian   44 2010-05-31          47387     0.00          China
997    Male      Asian   31 2019-06-10         176710     0.15  United States
998  Female      Asian   33 2012-01-28          95960     0.00          China
999  Female      Asian   63 2020-07-26         216195     0.31  United States

         City  Exit Date
995  Columbus        NaT
996   Chengdu 2018-01-08
997     Miami        NaT
998   Chengdu        NaT
999     Miami        NaT

## Exploring data in pandas

In [4]:
print(data1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EEID           1000 non-null   object
 1   Full Name      1000 non-null   object
 2   Job Title      1000 non-null   object
 3   Department     1000 non-null   object
 4   Business Unit  1000 non-null   object
 5   Gender         1000 non-null   object
 6   Ethnicity      1000 non-null   object
 7   Age            1000 non-null   int64
 8   Hire Date      1000 non-null   datetime64[ns]
 9   Annual Salary  1000 non-null   int64
 10  Bonus %        1000 non-null   float64
 11  Country        1000 non-null   object
 12  City           1000 non-null   object
 13  Exit Date      85 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), int64(2), object(9)
memory usage: 109.5+ KB
None

In [5]:
data1.describe()

,Age,Hire Date,Annual Salary,Bonus %,Exit Date
count,1000.000000,1000,1000.000000,1000.000000,85
mean,44.382000,2012-04-07 02:54:14.400000,113217.365000,0.088660,2016-11-02 18:04:14.117647104
min,25.000000,1992-01-09 00:00:00,40063.000000,0.000000,1994-12-18 00:00:00
25%,35.000000,2007-02-14 00:00:00,71430.250000,0.000000,2014-12-25 00:00:00
50%,45.000000,2014-02-15 12:00:00,96557.000000,0.000000,2019-05-23 00:00:00
75%,54.000000,2018-06-22 00:00:00,150782.250000,0.150000,2021-04-09 00:00:00
max,65.000000,2021-12-26 00:00:00,258498.000000,0.400000,2022-08-17 00:00:00
std,11.246981,NaN,53545.985644,0.117856,NaN

In [6]:
data1.isnull().sum()

EEID               0
Full Name          0
Job Title          0
Department         0
Business Unit      0
Gender             0
Ethnicity          0
Age                0
Hire Date          0
Annual Salary      0
Bonus %            0
Country            0
City               0
Exit Date        915
dtype: int64

##  Handling duplicate values in pandas

In [7]:
import pandas as pd 
data12 = pd.read_csv("company1.csv")
print(data)

   Unnamed: 0      Name gender  salary
0           0    ayushi      F   20000
1           1     rohit      M   25000
2           2  pranjali      F   27000

In [8]:
print(data12.duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [9]:
print(data12["EEID"].duplicated())

0    False
1    False
2    False
3     True
4    False
5    False
6     True
Name: EEID, dtype: bool

In [10]:
# remove duplicate values 
print(data12.drop_duplicates("EEID"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN

## Working with missing data in pandas

In [11]:
#if we have data of numerical then we use mean mehhod to fill data like salary 
# or we have a data of string then we use forward and backward filling like name ,gender.

In [12]:
data12.isnull().sum()

EEID      0
Name      1
gender    1
salary    2
dtype: int64

In [13]:
print(data12.dropna())

    EEID    Name gender   salary
1  EMP02   rohit      M  25000.0
3  EMP01  ayushi      F  20000.0
6  EMP02   rohit      M  25000.0

In [14]:
print(data12)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [15]:
#import numpy as np
#data["salary"] =  (data["salary"].replace(np.nan,24400)) # puttung the values by find their mean  ,, 
#print(data)

In [16]:
print(data12["salary"].mean())

24400.0

In [17]:
print(data12)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

## forward filling ,Backward filling

In [18]:
# we also use forward fill and backward fill   for those case when we have string data like name ,gender 
print(data12.fillna(method="bfill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F  25000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

In [19]:
print(data12.fillna("hyy"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      hyy
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    hyy  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       hyy      M  25000.0
5  EMP06     rohit      M      hyy
6  EMP02     rohit      M  25000.0

## Column Transformation in Pandas  Part 1

In [20]:
import pandas as pd 
df = pd.read_excel("ESD.xlsx")
#print(data3)
# for creating new column in the data 
df.loc[df["Bonus %"] == 0, "getBonus"] = "no Bonus"
df.loc[df["Bonus %"] > 0, "getBonus"] = "Bonus"


print(df.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date  getBonus
0     0.15  United States    Seattle 2021-10-16     Bonus
1     0.00          China  Chongqing        NaT  no Bonus
2     0.20  United States    Chicago        NaT     Bonus
3     0.07  United States    Chicago        NaT     Bonus
4     0.00  United States    Phoenix        NaT  no Bonus
5     0.00          China  Chongqing        NaT  no Bonus
6     0.10  United States    Phoenix        NaT     Bonus
7     0.00  United States      Miami 2021-05-20  no Bonus
8     0.06  United States     Austin        NaT     Bonus
9     0.00  United States    Chicago        NaT  no Bonus

In [21]:
# if i want to join to name each other like first name ans last name we can concatenete but we have different example 
import pandas as pd 
data12 = pd.read_csv("company1.csv")
print(data12)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [22]:
data12["Full-Name"] = data12["Name"].str.capitalize() +" "+data12["gender"]
print(data12)

print()

print(data12.fillna(method="bfill"))

    EEID      Name gender   salary Full-Name
0  EMP01    ayushi      F      NaN  Ayushi F
1  EMP02     rohit      M  25000.0   Rohit M
2  EMP03  pranjali    NaN  27000.0       NaN
3  EMP01    ayushi      F  20000.0  Ayushi F
4  EMP05       NaN      M  25000.0       NaN
5  EMP06     rohit      M      NaN   Rohit M
6  EMP02     rohit      M  25000.0   Rohit M

    EEID      Name gender   salary Full-Name
0  EMP01    ayushi      F  25000.0  Ayushi F
1  EMP02     rohit      M  25000.0   Rohit M
2  EMP03  pranjali      F  27000.0  Ayushi F
3  EMP01    ayushi      F  20000.0  Ayushi F
4  EMP05     rohit      M  25000.0   Rohit M
5  EMP06     rohit      M  25000.0   Rohit M
6  EMP02     rohit      M  25000.0   Rohit M

##  Column transformation part 2

In [23]:
import pandas as pd 
data5 = pd.read_csv("company1.csv")
print(data5)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [24]:
data5["Bonus"] = (data5["salary"]/100)*20   # find the 20 % bonus on the salary 
print(data5.fillna(method="bfill"))

    EEID      Name gender   salary   Bonus
0  EMP01    ayushi      F  25000.0  5000.0
1  EMP02     rohit      M  25000.0  5000.0
2  EMP03  pranjali      F  27000.0  5400.0
3  EMP01    ayushi      F  20000.0  4000.0
4  EMP05     rohit      M  25000.0  5000.0
5  EMP06     rohit      M  25000.0  5000.0
6  EMP02     rohit      M  25000.0  5000.0

In [25]:
data11 = {"Month":["january","feburary","march","april"]}
a = pd.DataFrame(data11)

print(a)
print()
def extract(values):
    return values[0:3]

a["Short_months"] = a["Month"].map(extract)   # if we create a function  he will apply on the all the values applying mapping 
print(a)

      Month
0   january
1  feburary
2     march
3     april

      Month Short_months
0   january          jan
1  feburary          feb
2     march          mar
3     april          apr

## Python pandas - group-by

In [26]:
# foe summarizing our data using group by function if we have a large data to understand 
import pandas as pd  
group = pd.read_excel("ESD.xlsx")
print(group.head(10))  # according to this data we cant understand  then we use group by function

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
5     0.00          China  Chongqing        NaT
6     0.10  United States    Phoenix        NaT
7     0.00  United States      Miami 2021-05-20
8     0.06  United States     Austin        NaT
9     0.00  United States    Chicago        NaT

In [27]:
gp = group.groupby(["Department","Gender"]).agg({"EEID":"count"})  # applying 2 level of group by first departenmt and second gender wise , .agg use for count 
print(gp)

                        EEID
Department      Gender
Accounting      Female    53
                Male      43
Engineering     Female    80
                Male      78
Finance         Female    69
                Male      51
Human Resources Female    64
                Male      61
IT              Female   119
                Male     122
Marketing       Female    57
                Male      63
Sales           Female    76
                Male      64

In [28]:
gp1= group.groupby(["Country","Gender"]).agg({"Annual Salary":"max","Age":"min"})
print(gp1)

                      Annual Salary  Age
Country       Gender
Brazil        Female         258426   25
              Male           249506   26
China         Female         249686   25
              Male           257194   25
United States Female         258498   25
              Male           258081   25

##  Merge concatenate and join pandas

In [29]:
import pandas as pd 
data1 = {"Emp id":["E01","E02","E03","E04","E05","E06"],
      "Names":["Ram","Shyam","Rahul","usman","salman","ali"],
      "Age":[34,56,23,44,32,36]}
data2 =  {"Emp id":["E01","E02","E03","E04","E05","E06"],
       "Salary":[45000,56000,34000,30000,50000,62000]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print(df1)
print()
print(df2)

  Emp id   Names  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03   Rahul   23
3    E04   usman   44
4    E05  salman   32
5    E06     ali   36

  Emp id  Salary
0    E01   45000
1    E02   56000
2    E03   34000
3    E04   30000
4    E05   50000
5    E06   62000

In [30]:
print(pd.merge(df1,df2,on= "Emp id"))    # on mean on the basis of  emplye id

  Emp id   Names  Age  Salary
0    E01     Ram   34   45000
1    E02   Shyam   56   56000
2    E03   Rahul   23   34000
3    E04   usman   44   30000
4    E05  salman   32   50000
5    E06     ali   36   62000

In [31]:
import pandas as pd 
data1 = {"Emp id":["E01","E02","E03","E04","E05","E06"],
      "Names":["Ram","Shyam","Rahul","usman","salman","ali"],
      "Age":[34,56,23,44,32,36]}
data2 =  {"Emp id":["E01","E07","E03","E04","E08","E06"],   # change the data  
       "Salary":[45000,56000,34000,30000,50000,62000]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print(df1)
print()
print(df2)

  Emp id   Names  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03   Rahul   23
3    E04   usman   44
4    E05  salman   32
5    E06     ali   36

  Emp id  Salary
0    E01   45000
1    E07   56000
2    E03   34000
3    E04   30000
4    E08   50000
5    E06   62000

In [32]:
print(pd.merge(left = df1, right= df2,on= "Emp id", how= "left"))  # left show all data but right show nan 
# it will miss 2 and 4 because they are not same in df1

  Emp id   Names  Age   Salary
0    E01     Ram   34  45000.0
1    E02   Shyam   56      NaN
2    E03   Rahul   23  34000.0
3    E04   usman   44  30000.0
4    E05  salman   32      NaN
5    E06     ali   36  62000.0

In [33]:
print(pd.merge(left = df1, right= df2,on= "Emp id", how= "right"))   # passing right  then in left show nan

  Emp id  Names   Age  Salary
0    E01    Ram  34.0   45000
1    E07    NaN   NaN   56000
2    E03  Rahul  23.0   34000
3    E04  usman  44.0   30000
4    E08    NaN   NaN   50000
5    E06    ali  36.0   62000

In [34]:
# concatenate precess have same dataframe
import pandas as pd 
data00 = {"Emp id":["E01","E02","E03","E04","E05","E06"],
      "Names":["Ram","Shyam","Rahul","usman","salman","ali"],
      "Age":[34,56,23,44,32,36]}

data99 = {"Emp id":["E07","E08","E09","E010","E011","E012"],
      "Names":["waleed","rehan","amir","huzaifa","rana","salo"],
      "Age":[34,56,23,44,32,36]}
df3 = pd.DataFrame(data00)
df4 = pd.DataFrame(data99)

In [35]:
print(pd.concat([df3,df4]))

  Emp id    Names  Age
0    E01      Ram   34
1    E02    Shyam   56
2    E03    Rahul   23
3    E04    usman   44
4    E05   salman   32
5    E06      ali   36
0    E07   waleed   34
1    E08    rehan   56
2    E09     amir   23
3   E010  huzaifa   44
4   E011     rana   32
5   E012     salo   36

## Comapre dataframe in pandas

In [36]:

# comapre  two dataframe 
import pandas as pd 
dict = {"fruits":["Mangoes","Apple","Banana","Orange"],
       "Price":[100,150,50,35],
       "Quantity":[15,10,10,3]}

dy1 = pd.DataFrame(dict)
print(df)
print()
dy2 = dy1.copy()
print(dy2)
print()
dy2.loc[0,"Price"]= 120
dy2.loc[1,"Price"]= 175
dy2.loc[3,"Price"]= 30

dy2.loc[0,"Quantity"]= 12
dy2.loc[1,"Quantity"]= 15
dy2.loc[3,"Quantity"]= 5

print(dy2)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date  getBonus
0       0.15  United States    Seattle 2021-10-16     Bonus
1       0.00          China  Chongqing        NaT  no Bonus
2       0.20  United States    Chicago        NaT     Bonus
3       0.07  United States    Chicago        NaT     Bonus
4       0.00  United States    Phoenix        NaT  no Bonus
..       ...            ...        ...        ...       ...
995     0.00  United States   Columbus        NaT  no Bonus
996     0.00          China    Chengdu 2018-01-08  no Bonus
997     0.15  United States      Miami        NaT     Bonus
998     0.00          China    Chengdu        NaT  no Bonus
999     0.31  United States      Miami        NaT     Bonus

[1000 rows x 15 columns]

    fruits  Price  Quantity
0  Mangoes    100        15
1    Apple    150        10
2   Banana     50        10
3   Orange     35         3

    fruits  Price  Quantity
0  Mangoes    120        12
1    Apple    175        15
2   Banana     50        10
3   Orange     30         5

In [37]:
print(dy1.compare(dy2))

   Price        Quantity
    self  other     self other
0  100.0  120.0     15.0  12.0
1  150.0  175.0     10.0  15.0
3   35.0   30.0      3.0   5.0

In [38]:
print(dy1.compare(dy2,align_axis=0))

         Price  Quantity
0 self   100.0      15.0
  other  120.0      12.0
1 self   150.0      10.0
  other  175.0      15.0
3 self    35.0       3.0
  other   30.0       5.0

## pivoting and melting Datafames

In [39]:
# in pivot we have three thing index,column name and values 
import pandas as pd 
dict = {"Keys":["k1","k2","k1","k2"],
       "Names":["john","ben","david","peter"],
       "Houses":["red","blue","green","red"],
       "Grades":["3rd","8th","9th","8th"]}

df = pd.DataFrame(dict)
print(df)
print()
print(df.pivot(index="Keys", columns="Names", values=["Houses", "Grades"]))

  Keys  Names Houses Grades
0   k1   john    red    3rd
1   k2    ben   blue    8th
2   k1  david  green    9th
3   k2  peter    red    8th

      Houses                   Grades
Names    ben  david john peter    ben david john peter
Keys
k1       NaN  green  red   NaN    NaN   9th  3rd   NaN
k2      blue    NaN  NaN   red    8th   NaN  NaN   8th

In [44]:
# Melting in pandas 
import pandas as pd 
dict = { "Names":["john","ben","david","peter"],
       "Houses":["red","blue","green","red"],
       "Grades":["3rd","8th","9th","8th"]}
df= pd.DataFrame(dict)
print(df)
print()
print(pd.melt(df, id_vars=["Names"],value_vars=["Houses","Grades"]))

   Names Houses Grades
0   john    red    3rd
1    ben   blue    8th
2  david  green    9th
3  peter    red    8th

   Names variable  value
0   john   Houses    red
1    ben   Houses   blue
2  david   Houses  green
3  peter   Houses    red
4   john   Grades    3rd
5    ben   Grades    8th
6  david   Grades    9th
7  peter   Grades    8th

## Series in pandas

In [47]:
import pandas as pd 
x = [5,6,7,8]
var = pd.Series(x)
print(var)
print()
print(type(var))   # this shoow is a series data structre 
print(var[2])    # accessign element using index value

0    5
1    6
2    7
3    8
dtype: int64

<class 'pandas.core.series.Series'>
7

In [51]:
import pandas as pd

x=[5,6,7,8]

var = pd.Series(x,index=['a','s','d','f'])   # if we want index not start from 0 it start from this 
print(var)
print(type(var))   # check the type 
print(var[2])  # accesiing through index number

a    5
s    6
d    7
f    8
dtype: int64
<class 'pandas.core.series.Series'>
7

In [52]:
import pandas as pd

x=[5,6,7,8] # we use list but also pass tuple ,dictonary 

var = pd.Series(x,index=['a','s','d','f'],dtype="float",name="Python")   # if we want index not start from 0 it start from this  also change datatypes
print(var)
print(type(var))   # check the type 
print(var[2])  # accesiing through index number

a    5.0
s    6.0
d    7.0
f    8.0
Name: Python, dtype: float64
<class 'pandas.core.series.Series'>
7.0

In [54]:
# passing dictionary 
dic = {"Name": ['python','c','c++','java'],"por":[12,13,14,15],"rank":[1,4,3,2]}

var1 = pd.Series(dic)
#var1
print(var1)
print(type(var1))

Name    [python, c, c++, java]
por           [12, 13, 14, 15]
rank              [1, 4, 3, 2]
dtype: object
<class 'pandas.core.series.Series'>

## Arithmetic operation

In [55]:
import pandas as pd 

var = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
var

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [57]:
var["C"] = var["A"] + var["B"]
print(var)

   A  B   C
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12

In [58]:
# for logical operation we use 
var1 = pd.DataFrame({"A":[10,20,30,40],"B":[15,16,17,18]})
var1

    A   B
0  10  15
1  20  16
2  30  17
3  40  18

In [59]:
var1["Python"] = var1["A"] <= 20
var1["Python_1"] = var1["B"] >= 16
var1

    A   B  Python  Python_1
0  10  15    True     False
1  20  16    True      True
2  30  17   False      True
3  40  18   False      True